const classificationData = [
  {
    "id":"1",
    "name":"可回收物",
    "color":"#0c6eb7",
    "explain":"废纸张、废塑料、废玻璃制品、废金属、废织物等适宜回收、可循环利用的生活废弃物",
    "require":"轻投轻放；清洁干燥，避免污染；废纸尽量平整；立体包装物请清空内容物，清洁后压扁投放；有尖锐边角的，应包裹后投放",
    "common":"奥特曼卡片、奥特曼玩具、白酒瓶、白银、扳手、办公用纸、办公桌、包装盒、包装胶袋、包装纸、保温袋、保温瓶、保鲜膜、报废车辆、报纸、抱枕、被单、被子、笔记本电脑、变形金刚、冰淇淋盒、玻璃、玻璃杯、玻璃放大镜、玻璃锅盖、玻璃壶、玻璃瓶、玻璃烟灰缸、不锈钢杯子、不锈钢垃圾桶、不锈钢勺子、布包、布条、布娃娃、布鞋、布艺窗帘、步步高学习机、草稿本、草稿纸、插线板、插座、茶几、茶叶罐、衬衫、充电器、充电热水袋、充电牙刷、充电装置、除湿机、传真机、窗户玻璃、床单、床垫、吹风机、磁带播放器、磁铁、打印机、打印纸、弹簧、蛋挞盒、刀、刀片、地板砖、地毯、地铁票、点心盒、电冰箱、电吹风、电磁炉、电动保温箱、电动卷发棒、电动剃须刀、电动玩具、电动牙刷、电炖锅、电饭煲、电话机、电烤箱、电脑、电脑包、电瓶、电瓶车、电热毯、电视机、电网扇、电线、电源插头、电子血压仪、钉子、订书机、动感单车、耳钉、耳环、耳机、二手手机、帆布包、帆布袋、防晒衣、废旧报纸、废旧电子产品、废旧木柴、废旧吸铁石、废模具等金属材料、废弃塑料文具、废弃衣服、废塑料袋、废锁头、废钥匙、废纸、蜂蜜罐、复读机、复印机、复印纸、擀面杖、干发帽、干净饮料瓶、钢化玻璃、钢化膜、钢琴、高跟鞋、高压锅、隔热手套、公文包、购物卡、鼓棒、广告用纸、锅、果冻杯、过滤网、海报、红酒瓶、护发素瓶、护肤品玻璃罐、护肤乳液瓶、花露水瓶、滑板、化妆品瓶、化妆水瓶、划船机、画框、黄金、会员卡、鸡蛋盒、家电家具、剪刀、键盘、酱油瓶、交通卡、胶盒、胶手套、胶指套、接线板、洁厕灵瓶子、金戒指、金器、金手链、金属管、金属罐、金属盒、金属零件、金属门吸、金属瓶盖、金属拖把杆、金属文件柜、金属香炉、金属钥匙扣、金项链、金子、镜片、酒精瓶、旧报纸、旧被单、旧布鞋、旧夹子、旧帽子、旧皮鞋、旧手提包、旧书包、旧塑料篮子、旧锁、旧铁锅、旧拖鞋、旧玩具、旧玩偶、旧鞋子、旧衣服、旧瑜伽垫、旧枕头、旧纸袋、咖啡隔热紙、抗光屏、靠垫、可口可乐瓶、可乐罐、可乐瓶、可乐瓶瓶盖、课本、肯德基纸袋、空调机、空气净化器过滤网、裤子、快递盒、矿泉水瓶、矿泉水瓶盖、垃圾桶、垃圾箱、拉杆箱、篮球、老干妈瓶子、老虎钳、乐高积木、脸盆、晾衣架、料酒瓶、淋浴套装、铃铛、溜冰鞋、六神花露水瓶、路由器、铝箔纸、铝膜、轮胎、螺钉、螺丝刀、马桶盖、脉动饮料瓶、毛巾、毛绒玩具、毛毯、毛线、美工刀、密胺餐具、棉被、棉布、棉花被、棉质衣服、面霜瓶、灭火器、名片、墨水瓶、墨汁瓶、木板、木凳、木棍、木积木、木筷、木梳、木条、木头、木椅、木质拼版、木质梳子、木质拖把杆、幕布、奶茶塑料盖、奶粉罐、牛奶盒、牛奶瓶、牛皮包、牛仔裤、暖水瓶、拍拍净瓶罐、排插、跑步机、泡沬板、泡沬保温箱、泡沬箱、泡沫塑料、皮包、皮带、皮夹、皮具、皮鞋、皮质钱包、啤酒盖、啤酒罐、啤酒瓶、平板玻璃、平衡车、起钉器、气泡缓冲材料、汽车、汽车玻璃、铅球、清洁剂容器、球拍、球鞋、热得快、热水袋、热水瓶、热水器、乳液罐、乳液瓶、软玻璃、软桶、扫地机、扫地机器人、扫描仪、沙发、纱线手套、烧水壸、蛇皮袋、摄像机、摄像头、摄影机、身体乳、绳子、石圭胶玩具、食品保鲜盒、食品罐头、食用油桶、收据、收音机、收银条、手办、手表、手电筒、手机、手链、手镯、书包、书本、鼠标、甩脂机、爽肤水瓶、水果网套、水晶板、水龙头、说明书、速冻食品保温袋、塑复钢管、塑料包装、塑料包装纸盒、塑料薄膜、塑料杯、塑料杯套、塑料餐具、塑料饭盒、塑料花盆、塑料假花、塑料壳、塑料垃圾桶、塑料晾衣杆、塑料膜、塑料泡沫、塑料盆、塑料瓶瓶盖、塑料日用品、塑料收纳盒、塑料梳子、塑料水管、塑料酸奶盒、塑料桶、塑料玩具、塑料药盒、塑料衣架、塑料纸、酸奶杯、酸奶盒、碎玻璃片、碎玻璃制品、碎纸、台布、台灯、台历、台式电脑、太空望远镜、糖果罐、糖果盒、藤条、剃须刀、剃须刀片、铁锤、铁调羹、铁钉、铁管、铁罐、铁盒、铁盒子、铁皮罐头、铁丝、铁制品、铜管、铜丝、铜制品、投影仪、拖把桶、椭圆机、袜子、玩具盒、玩具塑料盒、网线、望远镜、微波炉、卫生巾外层薄塑纸、未被污染的输液袋、未被污染的输液瓶、文件柜、钨丝灯、无纺布包、无纺布手提袋、无人机、午餐肉罐头、吸门器、吸铁石、洗涤液瓶、洗发水瓶、洗洁精瓶、洗脸仪、洗面奶瓶、洗手液瓶、洗碗机、洗衣机、洗衣液瓶、鲜奶盒、显卡、香槟瓶、香水瓶、香烟売、项链、橡胶皮袋、橡皮圈、消毒液瓶、消费卡、小米手环、小木棍、小票、小提琴、鞋带、鞋垫、信封、信纸、星巴克杯托、星巴克纸袋、星巴克纸袋 泳衣、宣传单、雪碧罐、雪碧瓶、眼镜架、眼霜罐、养乐多瓶、腰带、遥控器、钥匙、衣服吊牌、衣服干洗剂瓶、衣架、宜家纸盒、移动硬盘、椅子、易拉罐、易拉罐拉环、饮料瓶、饮料瓶盖、隐形眼镜包装盒、硬板纸、硬纸板、硬质塑料瓶、泳帽、泳衣、油桶、游戏手柄、有机玻璃、瑜伽垫、雨伞骨架、雨鞋、浴霸、浴帘、月饼盒、运动鞋、杂志、簪子、照相机、真空压缩袋、砧板、枕巾、枕套、枕头、纸、纸板箱、纸袋子、纸巾盒、纸塑铝复合包装、纸质杯套、纸质卡片、纸质礼品盒、纸质印刷品、指甲钮、指南针、紙盒、紙牌、紙箱、置物架、钟表、竹签、主板、砖头、桌布、自拍杆、自行车、自行车轮胎、棕榈蜡、钻石、作业本、座椅垫、ABS胶水管、iPad、iWatch、MP3、MP4、PET塑料瓶、PS废胶片、PVC胶水管、SMI卡、U盘"
  },
  {
    "id":"2",
    "name":"有害垃圾",
    "color":"#e53123",
    "explain":"对人体健康或自然环境造成直接或潜在的危害废弃物。",
    "require":"充电电池、纽扣电池、蓄电池投放时应注意轻放；油漆桶、杀虫剂如有残留请密闭后投放；荧光灯、节能灯易破损连带包装或包裹后投放；废药品及其包装一并投放",
    "common":"安神补脑液瓶、白炽灯、板蓝根冲剂、保健品、笔记本电脑电池、玻璃药瓶、充电电池、打印机墨盒、灯泡、调色板、冻干粉、废胶片、废节能灯、废旧小家电、废矿物油、废镍镉电池、废农药、废弃灯泡、废弃药瓶、废水银温度计、废水银血压计、废血压计、废荧光灯管、废油漆、钙片、感光胶片、感冒药、膏药、工业胶水、过期的胶嚢药物、过期感冒药、过期药片、过期药品、过期指甲油、咳嗽药水瓶、胶合剂、胶卷底片、胶囊、胶片、节能灯（含水银）、酒精、开塞露、空调清洗消毒液瓶、空药瓶、口服液、口服液瓶、老鼠药、雷达瓶子、锂电池、卤素灯、录像带、煤气罐、镍镉电池、纽扣电池、钮扣电池、农药瓶、铅酸电池、染发剂、染发剂壳、染发手套、日光灯、杀虫剂、杀虫喷雾、杀虫子罐、生石灰、手机电池、树脂、水银体温计、塑料药瓶、硒鼓、相片底片、消毒剂、卸甲膜、卸甲水、蓄电池、眼药水、眼药水瓶、氧化汞电池、药包装、药膏、药膏包装売、药剂、药片包装、药品包装袋、药瓶、药水玻璃瓶、一次性注射器、医用棉签、医用纱布、医用手套、医用针管、荧光灯、油画颜料、油画颜料软管、油漆笔、油漆桶、照片、针管、针筒、针头、指甲油瓶子、中性笔、注射器、LED灯（含水银）、X光片"
  },
  {
    "id":"3",
    "name":"湿垃圾",
    "color":"#664033",
    "explain":"部分地区又称”厨余垃圾”，日常生活垃圾产生的容易腐烂的生物质废物。",
    "require":"餐厨垃圾应沥干水分后再投放，有包装物的应取出后分类投放；大块骨头和椰子壳，榴莲壳等不易生化降解，作为干垃圾进行投放；纯液体（如牛奶等），可直接倒入下水口",
    "common":"艾草、八宝粥、八角、白茶、白糖、百香果売、板栗、板栗壳、板栗叶、棒棒糖、包子、爆米花、扁見、饼干、菠萝、菠萝蜜核、菠萝皮、布丁、彩叶、菜皮、残枝落叶、蚕豆、苍蝇、草本植物、草莓、草莓叶、叉烧、茶叶、茶叶渣、茶渣、炒花生米、车厘子核、橙皮、橙子、橙子皮、虫子、宠物粪便、宠物饲料、茨菇、葱、大白菜、大米、大排、大蒜皮、大蒜叶、大闸蟹、大闸蟹売、蛋白、蛋糕、蛋黄、蛋卷、蛋挞、凋谢的鲜花、调料包、冬瓜、冬瓜皮、冬笋売、冬枣、动物粪便、动物内脏、动物尸体、豆腐、豆浆、豆浆渣、豆芽、豆制品、多宝鱼骨头、多肉植物、鹅骨头、鹅肉、番茄、番茄酱、方便面、废弃调味品、废弃食用油、废弃植物、蜂蜜、凤梨皮、凤梨酥、甘蔗、甘蔗皮、甘蔗渣、橄榄核、干脆面、干果仁、干辣椒、干面条、干树叶、狗粮、狗屎、枸杞页、瓜果、瓜子、瓜子売、瓜子皮、桂皮、桂圆核、桂圆売、果冻、果皮、过期大米、过期调味品、过期巧克、过期巧克力、过期食品、过期糖、哈密瓜、哈密瓜籽、蛤肉、海底捞锅底、海瓜子売、海苔、海藻、汉堡、核桃肉、荷叶、盒饭、红豆、红豆糕、红奉、红辣椒、红薯、红枣核、胡椒粉、胡萝卜、花瓣、花茶渣、花蛤売、花卉、花甲、花甲壳、花椒、花生、花生酱、花生壳、花生衣、话梅肉、黄瓜、黄瓜皮、黄仁核、黄油、茴香、火锅底料、火锅渣、火龙果、火龙果皮、鸡翅、鸡蛋、鸡蛋饼、鸡蛋皮、鸡蛋仔、鸡骨头、鸡脚爪、鸡精、鸡排、鸡皮、鸡肉、鸡屎、鸡腿、茄子、甲鱼、煎饼、姜、姜糖、酱料、茭白、茭白叶、叫花鸡、金针菇、韭菜、酒酿、桔梗、桔普茶、橘子皮、咖啡伴侣粉、咖啡残渣、咖啡豆、咖啡豆渣、咖啡粉、咖啡渣、咖喱粉、可降解垃圾袋、枯树叶、矿物猫砂、括子皮、辣椒、辣椒酱、辣条、烂水果、老鼠、梨、藜麦、李子、李子核、荔枝皮、栗子、栗子壳、榴莲肉、榴莲酥、龙虾片、绿豆、绿豆糕、绿萝、萝卜干、螺蛳、螺蛳壳、螺蛳肉、麻辣烫、馒头、芒果核、芒果皮、猫粮、猫砂、猫屎、猫屎咖啡、毛豆壳、猕猴桃、米饭、面包、面包屑、面饼、面粉、面条、蘑菇、奶茶中的珍珠、奶粉、奶酪、奶油、南瓜皮、南瓜籽、年糕、柠檬、柠檬皮、牛排、牛肉、牛肉干、牛肉果核、牛肉拉面、牛蛙、牛蛙骨、牛油果皮、糯米、藕片、排骨、螃蟹壳、披萨、皮蛋、枇杷核、乒乓糯米糕、平菇、苹果派、苹果皮、苹果肉、葡萄干、葡萄梗、葡萄皮、葡萄籽、普洱茶、奇异果、巧克力、巧克力酱、青菜、青椒、青蟹壳、热干面、肉类、三文鱼、山药、山楂、山竹壳、扇贝肉、生鸡蛋壳、牲畜粪便、剩菜剩饭、石榴、石榴籽、食品添加剂、食物残渣、食用油、蔬菜、蔬菜残余、熟鸡蛋壳、薯格、薯片、薯条、树叶、水草、水果、水果干、水果皮、水果软核、水蜜核桃、水蜜桃、丝瓜皮、松子壳、速冻馄饨、速冻水饺、酸豆角、蒜皮、蒜头、笋売、笋皮、糖、糖果、桃子、桃子核、蹄髈、甜辣椒、甜品、铁观音、土豆、土豆泥、土豆皮、兔子、外卖餐盒、豌豆皮、味精、蚊子、乌龙茶、午餐肉、吸管可降解纸质包装、西餐糕点、西瓜、西瓜皮、西红柿、西兰花、西兰花梗、喜糖、虾、虾壳、鲜花、咸菜、咸蛋、咸蛋黄、咸蛋売、咸鸭蛋壳、香榧子壳、香菇、香瓜皮、香瓜子、香蕉、香蕉皮、小核桃肉、小龙虹売、小龙虾、小龙虾黄、小龙虾肉、小龙虾头、小米、蟹肉、杏核、杏仁、杏仁饼、杏仁核、朽1檬皮、压缩饼干、鸭脖、鸭翅、鸭蛋壳、鸭骨头、鸭肉、鸭腿、鸭爪、盐、盐水花生、盐水花生壳、燕麦、燕麦片、杨梅核、洋葱皮、腰果、椰果、椰肉、一次性餐盒、樱桃干、樱桃梗、樱桃核、油桃、油条、油烟机油脂、叉烧肉、柚子核、柚子皮、鱼刺、鱼骨头、鱼鳞、鱼内脏、鱼肉、鱼虾、玉米棒、玉米猫砂、玉米芯、玉米须、杂菜、杂草、枣核、枣子核、炸鸡、榨菜、蟑螂、芝麻、芝麻酱、芝士、植物枝干、纸质吸管、中药包、中药渣、粥、猪蹄、猪蹄骨、竹笋、孜然粉、紫薯皮、粽子馅"
  },
  {
    "id":"4",
    "name":"干垃圾",
    "color":"#2c2b27",
    "explain":"部分地区又称”其他垃圾”，除有害垃圾、可回收物、湿垃圾以外的生活废弃物。",
    "require":"尽量沥干水分；难以辨别的生活垃圾应投入干垃圾容器内",
    "common":"1号电池(无汞）、5号电池(无汞）、7号电池(无汞）、艾灸条、艾灸贴、安全套、安全套包装袋、白板笔、百洁布、棒棒糖棒子、包裹着狗屎的报纸、包裹着狗屎的纸巾、包裹着口香糖的纸巾、包裹着猫屎的猫砂、包裹着猫屎的塑料袋、包裹着痰的紙巾、包裹着西瓜籽的纸巾、包裏着鼻屎的纸巾、包裏着鼻涕的纸巾、包裏着狗屎的塑料袋、保冷剂、保鲜袋、鲍鱼壳、爆竹、杯子、贝壳、被污染的垃圾袋、被油污污染过的报纸、鼻屎、鼻涕纸、笔袋、壁纸、避孕套、编织袋、鞭炮、便利贴、便纸、标签、别针、冰棒棍、冰棒皮、冰棒外包装、冰宝贴、冰袋、冰淇淋包装袋、冰贴、冰箱贴、饼干包装袋、玻璃胶、擦过鼻涕的纸巾、擦碗布、彩泥、菜板、餐饮外卖盒、草木灰、草席、草纸、测血糖针、茶包、茶壷、茶叶包、蛏子売、成分复杂的制品、成人用品、宠物毛、抽纸塑料袋、除湿袋、除湿盒、除湿剂、厨房手套、厨房用纸、储奶袋、创口贴、唇釉、瓷器碎片、瓷碎片、磁带、醋包、醋袋、打包盒、打火机、大块骨头、大龙虾売、大米袋、大头针、带胶制品、带有婴儿粪便的尿不湿、带有婴儿粪便的纸尿裤、袋泡茶、蛋糕袋、蛋糕盒、稻草、滴漏式咖啡、帝王蟹売、电动牙刷刷头、电话卡、电蚊香片、电子烟烟弹、吊牌、调料袋、订书钉、订书针、动物毛、豆腐盒、豆浆杯、豆浆袋、痘痘贴、耳塞、耳屎、发带、发箍、发夹、发胶、发蜡、发票、发热包、番茄酱包装袋、方便面调味包、方便面盒、方便面桶、防腐剂、防霉防蛀片、防晒喷雾、防晒霜、防碎气泡膜、肥料、肥皂、废弃的纸张、废弃食品袋、粉笔、粉饼盒、粉尘、粉底、粉扑、风油精、封箱带、干冰、干草、干电池(无汞）、干花、干净无油食品包装袋、干燥剂、钢笔、钢丝球、高密度碎纸机处理过的碎纸、狗毛、狗尿垫、固体胶、挂耳咖啡、光盘、广告颜料、硅胶猫砂、过滤袋、过期防晒霜、过期护肤品、过期化妆品、过期口红、蛤蜊売、海螺壳、海绵、海绵单、海绵粉扑、河蚌壳、核桃壳、烘培纸、红酒塞、胡须、护发精油、护理垫、护手霜、花蛤、花泥、花盆、化妆棉、化妆刷、画笔、话梅核、坏的花盆、坏马桶、黄油包装纸、灰尘、灰土、徽章、回形针、活性炭、火柴、火腿肠包装纸、鸡毛、记号笔、寄居蟹、甲鱼壳、假发、假睫毛、坚果売、碱性电池、浆糊、酱油袋、胶带、胶带纸、胶画、胶囊咖啡、胶水、胶纸、脚皮、脚趾甲、洁面摩丝、金属、镜子、酒精棉花、旧镜子、旧毛巾、旧水槽、旧浴缸、卷筒纸、卷筒纸外包装、咖啡杯杯盖、咖啡胶囊、咖啡滤纸、开心果、口香糖、枯萎花草、快餐盒、快递包装袋、快递单、筷子、垃圾袋、拉链、蜡笔、蜡烛、蜡烛包装、辣条包装袋、冷饮棒、冷饮包装、炼乳壳、凉席、零食包装袋、榴莲核、榴莲売、柳絮、炉渣、滤挂咖啡、滤芯、滤纸、麻绳、马夹袋、马克笔、马桶刷、麦当劳紙盒、猫罐头、猫毛、毛笔写过的纸、毛发、毛衣针、眉笔、眉粉、美瞳、美妆蛋、密封袋、棉棒、棉花、棉花棒、棉花球、棉签、棉柔巾、棉绳、棉线、面包袋、面巾纸、面膜、面膜包装袋、面膜外层纸、面纸、灭蚊灯、明信片、摩斯罐、磨砂膏、抹布、墨胆、墨镜、墨嚢、牡蛎壳、木屑、沐浴球、奶茶杯、奶茶塑料杯、奶茶纸杯、奶嘴、内裤、内衣、尼龙制品、泥土、尿垫、尿片、牛骨、牛骨棒、牛骨头、牛肋骨、牛奶袋、纽扣、暖宝宝、暖宝宝贴、呕吐物纸巾、泡沬饭盒、泡面袋、泡面桶、泡沫盒子、盆子、披萨盒、皮皮虾売、啤酒瓶盖、乒乓球、平角裤、葡萄酒木塞、气垫膜、气泡膜、气球、铅笔、铅笔屑、签字笔、墙纸、巧克力包装袋、琴弦、青草膏、青口贝、驱蚊手环、驱蚊香片、热饮杯盖、肉骨头 塑料袋、乳胶、软木塞、润唇膏、润肤乳、三角裤、扫把、纱布、砂锅、扇贝壳、烧烤木签、烧烤锡纸、生蚝壳、盛放厨余果皮的垃圾袋、湿灰尘、湿垃圾袋、湿塑料袋、湿头发、湿纸巾、湿纸巾包装、石膏、石锅、食品保鲜袋、食品密封袋、食品塑料盒、使用过的安全套、使用过的卫生巾、使用讨的面腊、手机壳、手机膜、手帕、手指甲、鼠标垫、薯片包装袋、薯片袋、薯片罐、薯片盒、树枝、双面胶、双眼皮贴、水笔、水笔笔芯、水彩笔、水彩颜料、水果塑料盒、水饺包装袋、水晶猫砂、水晶泥、丝袜、松木猫砂、塑封袋、塑料笔杆、塑料表带、塑料打包盒、塑料盖子、塑料花、塑料垃圾袋、塑料勺、塑料拖鞋、塑料外卖盒、塑料吸管、酸奶杯盖、酸奶袋、酸奶勺、碎碗、太空沙、太阳眼镜、坛子、糖包、糖果皮、糖浆包、糖纸、桃核、陶瓷类废弃物、陶瓷碗碟、陶瓷制品、陶泥、陶土花瓶、剃须泡沫罐、田螺売、贴纸、头发、头饰、头屑、透明打包盒、透明胶、退热贴、拖把、拖鞋、脱毛膏、脱氧剂、瓦片、外卖餐具、外卖饭盒、外卖盒子、外卖塑料袋、外卖塑料盒、外卖纸盒、网球、卫生护垫、卫生间用纸、卫生巾、卫生巾包装袋、卫生巾外包装、卫生棉条、卫生纸、卫生纸内芯、文蛤売、文件袋、文胸、蚊香、蚊香灰、蚊香片、乌龟壳、污染较严重的纸、污染纸张、污损塑料袋、污损纸张、污渍纸巾、吸尘器灰尘、吸管、吸管塑料包装、吸油纸、西梅核、洗涤液包装袋、洗脸巾、洗头膏、洗碗布、洗衣粉、洗衣液包装袋、下水道杂物、夏威夷果壳、线、相册、香肠売、香薰球、香烟、香烟头、橡胶、橡胶手套、橡胶制品、橡皮、橡皮筋、橡皮泥、小核桃売、小纸屑、卸妆膏、卸妆棉、卸妆纸巾、信用卡、胸罩、修正带、修正液、绣花针、宣紙、雪糕棒、雪糕包装袋、雪糕袋、血糖试纸、牙齿、牙膏、牙膏壳、牙膏皮、牙签、牙签塑料盒、牙刷、牙线、牙线棒、烟蒂、烟盒、烟灰、胭脂、眼镜、眼线笔、眼影、验孕棒、羊大骨、羊骨、羊蝎子、椰子売、一次性保鲜膜、一次性餐具、一次性打火机、一次性咖啡纸杯、一次性口罩、一次性筷子、一次性手套、一次性塑料餐盒、一次性塑料袋、一次性塑料调羹、一次性塑料盘、一次性塑料勺子、一次性塑料手套、一次性塑料浴帽、一次性用品、一次性纸杯、一次性纸餐盘、一次性竹筷子、衣服标签、姨妈巾、隐形眼镜、隐形眼镜护理液、印泥、婴儿尿布、荧光棒、荧光笔、营养土、永生花、泳镜、油画刷、油条包装袋、油污纸、油脂、羽毛球、雨披、雨衣、玉米皮、玉米衣、圆珠笔、圆珠笔芯、脏玻璃瓶、脏抹布、脏卫生巾、脏污衣服、脏卸妆棉、脏纸巾、脏纸尿裤、渣土、榨菜袋、沾有油渍的食品包装袋、粘尘纸、粘毛滚纸、粘鼠板、粘土、榛子壳、蒸汽眼罩、织物、植物硬壳、纸饭盒、纸巾、纸巾包装袋、纸巾袋、纸尿裤、纸皮核桃、纸质包装袋、纸质外卖盒、指甲片、酯袋、智齿、中药袋、猪大骨、猪骨头、猪腿骨、竹制品、砖块、砖瓦陶瓷、装过湿垃圾的塑料袋、装蔬菜的塑料袋、装修废弃物、紫砂壶、自动铅笔笔芯、自热火锅加热包、粽叶、A4纸包装袋、PH试纸"
  }
]

// 汉字按字母排序 && 去重
function sortArray(arr) {
  const newArr = arr.sort((str1, str2) => {
    return str1.localeCompare(str2, 'zh');  
  })
  return Array.from(new Set(newArr))
}
const garbageData = classificationData.reduce((total, classification) => {
  const initArr = classification.common.split('、')
  let commonArr = sortArray(initArr)
  commonArr = commonArr.map(item => {
    return { id: classification.id, name: item }
  })
  return total.concat(commonArr)
}, [])

export default { garbageData, classificationData }

